{"emails": {"1": {"subject": "December 18, 2024 -  Maintain shipping velocity", "sender": "\"Product Hunt Dev (aka WeirdWideWeb)\" <hi@dev.producthunt.com>", "body": "December 18, 2024 - Maintain shipping velocity Supabase's secret to relentless shipping ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ December 18, 2024 | Read Online The Breakpoint Greetings, devs across the world. Welcome back to another edition of the Breakpoint. In this week’s edition, we’ve got the latest in dev tools on the Leaderboard + an amazing deep dive from the co-founder of Supabase detailing how the company maintains its remarkable shipping velocity. Let’s dive in. The Latest Five of the most interesting recent dev tool (or dev tool-adjacent) launches on the site. Tempo is a Visual Editor for React, which gives PMs, designers, and engineers the ability to collaborate visually on code. It looks like a design tool but functions like an IDE. SmythOS lets you build and deploy AI agents without manual coding. Describe your needs, and it will create an agent using the best AI models and APIs. DepthAI is a tool that helps you answer complex questions on large and messy codebases. It reduces time to onboard new engineers from months to days and enables teams to ship code faster. The Bolt Chrome Extension is a place to manage and access all of your code snippets on the fly. You can organize them by color coding and you insert snippets just by hitting ‘/’. Claude Folder Extension is an extension that lets you upload entire folders to Claude AI with one click. Maintains folder structure, automatically filters irrelevant files, and includes custom regex filtering. How we launch at Supabase Supabase co-founder and CTO Ant Wilson explains how his company relentlessly ships fast. At Supabase, we often get asked about how we're able to ship so relentlessly, and being an open source company we thought it appropriate to start \"open sourcing\" some of our methods around building and shipping. Our user base is constructed of companies and individuals who themselves are building for the web and marketing to enormous audiences. Hopefully they can learn some of our tricks and in turn contribute back to the community with their own launch strategies and tactics, helping us continuously learn and improve. Before I go into the nuts and bolts of what Launch Week is, and the exact processes we follow when executing one, it's probably useful if I explain how we landed on this methodology in the first place… Read the full article here. What did you think of today's newsletter? 😻 😾 Update your email preferences or unsubscribe here © 2024 Product Hunt Dev 228 Park Ave S, #29976, New York, New York 10003, United States Powered by beehiiv Terms of Service", "date": "Wed, 18 Dec 2024 22:18:30 +0000 (UTC)", "summary": "In the December 18, 2024 edition of The Breakpoint newsletter, the following topics are covered:\n\n1. The Latest: Five recent launches of developer tools and tool-adjacent services are highlighted. These include Tempo, a visual editor for React that allows collaboration between PMs, designers, and engineers; SmythOS, a tool for building and deploying AI agents without manual coding; DepthAI, a tool for answering complex questions on large and messy codebases; The Bolt Chrome Extension, a tool for managing and accessing code snippets; and Claude Folder Extension, an extension that allows for easy uploading of entire folders to Claude AI.\n\n2. Maintains shipping velocity at Supabase: Supabase co-founder and CTO Ant Wilson discusses how the company maintains its remarkable shipping velocity. Wilson explains that the company's user base is composed of companies and individuals who are building for the web and marketing to large audiences. Wilson also shares insights into the company's Launch Week methodology and the processes they follow when executing a launch.\n\nReaders can find the full article on the Supabase launch strategy here: [Supabase Launch Strategy](URL)\n\nThe newsletter also includes a request for feedback and an option to update email preferences or unsubscribe."}, "2": {"subject": "3 Data Science Projects That Got Me 12 Interviews. And 1 That Got Me\r\n in Trouble. | Zach Quinn in Pipeline: Your Data Engineering Resource", "sender": "Medium Daily Digest <noreply@medium.com>", "body": "Stories for Varad @clutterfreemailtest · Become a member Today's highlights Zach Quinn in Pipeline: Your Data Engineering Resource 3 Data Science Projects That Got Me 12 Interviews. And 1 That Got Me in… 3 work samples that got my foot in the door, and 1… 7 min read 5.1K 122 The Coding Diaries in The Coding Diaries Why Experienced Programmers Fail Coding Interviews A friend of mine recently joined a FAANG company as an… 5 min read 10.5K 283 Adrian H. Raudaschl in Towards Data Science Forget RAG, the Future is RAG-Fusion The Next Frontier of Search: Retrieval Augmented… 10 min read 3.1K 36 John Vastola 10 Must-Know Machine Learning Algorithms for Data Scientists Machine learning is the science of getting computers… 7 min read 978 19 Ignacio de Gregorio Apple Speaks the Truth About AI. It’s Not Good. Are We Being Lied To? 10 min read 5.9K 209 Zach Quinn in Pipeline: Your Data Engineering Resource Creating The Dashboard That Got Me A Data Analyst Job Offer A walkthrough of the Udemy dashboard that got me a job… 9 min read 1.8K 29 Elizabeth Spiers American Horror Story Rage at the U.S. healthcare system may be the only… 7 min read 680 18 Eiki Takeuchi in Beyond Agile Leadership Why Hiring High-Performance Developers is the Biggest Mistake for ROI. Do This… When I was working as a software engineer in Japan, I… 7 min read 754 50 Joseph Park in Digital Architecture Lab Where did Go go? : A case study of a mechanized mind Lee Sedol reflects on how AI has transformed the game… 7 min read 41 2 The Conversation U.S. in The Conversation Why school police officers may not be the most effective way to prevent… The presence of police in schools has grown in the… 5 min read 1K 24 Shivanshu Gupta in Towards AWS Opensource alternatives to paid SaaS Here are 10 opensource free software that you can use… 4 min read 753 16 Mary Chang Story Writer in Human Parts I Thought I Was Ugly Until I Posed Nude Then the other woman seduced and betrayed me 9 min read 6.2K 101 Ágoston Török in DataDrivenInvestor How to Draw a Strategy in 4 Steps One strategic picture says more than a thousand… 10 min read 1.2K 10 Andrew Zuo in Mac O’Clock I Was Wrong About Nano-Texture Thoughts On The M4 MacBook Pro 15 min read 185 2 Chandima Ekanayake in Stackademic These two are the most useful in ChatGPT canvas The ChatGPT canvas is so cool. But I think these are… 3 min read 322 2 See more of what you like and less of what you don’t. Control your recommendations Read from anywhere. Sent by Medium · Medium, 548 Market St, PMB 42061, San Francisco, CA 94104 Unsubscribe from this type of email · Switch to the Weekly Digest · Careers · Help Center · Privacy Policy · Terms of service", "date": "Thu, 19 Dec 2024 01:50:00 +0000 (UTC)", "summary": "Today's newsletter highlights several articles across various tech and data science topics:\n\n1. Zach Quinn in Pipeline: Your Data Engineering Resource - Creating The Dashboard That Got Me A Data Analyst Job Offer: This article provides a walkthrough of a Udemy dashboard that helped the author secure a data analyst job offer. [Link]\n\n2. 3 Data Science Projects That Got Me 12 Interviews. And 1 That Got Me in…: The author shares three data science projects that helped them secure 12 job interviews, along with one project that ultimately led to their successful job placement. [Link]\n\n3. The Coding Diaries in The Coding Diaries Why Experienced Programmers Fail Coding Interviews: This article discusses why experienced programmers may struggle in coding interviews and offers tips for success. [Link]\n\n4. Forget RAG, the Future is RAG-Fusion: The Next Frontier of Search: Retrieval Augmented Generation (RAG-Fusion) is explored as the next evolution in search technology. [Link]\n\n5. 10 Must-Know Machine Learning Algorithms for Data Scientists: This article provides an overview of ten essential machine learning algorithms that every data scientist should know. [Link]\n\n6. Apple Speaks the Truth About AI. It’s Not Good. Are We Being Lied To?: This article discusses Apple's stance on AI and raises questions about the potential dangers of AI technology. [Link]\n\n7. Elizabeth Spiers in American Horror Story Rage at the U.S. healthcare system may be the only…: This article expresses frustration with the U.S. healthcare system and suggests that anger may be the only viable response. [Link]\n\n8. Why Hiring High-Performance Developers is the Biggest Mistake for ROI: This article argues that focusing on high-performance developers may not always lead to the best return on investment. [Link]\n\n9. Where did Go go? : A case study of a mechanized mind: This article reflects on the impact of AI on the game of Go and the transformation it has undergone. [Link]\n\n10. Why school police officers may not be the most effective way to prevent…: This article questions the effectiveness of school police officers in preventing violence and suggests alternative approaches. [Link]\n\n11. Opensource alternatives to paid SaaS: This article offers a list of open-source software alternatives to paid SaaS solutions. [Link]\n\n12. I Thought I Was Ugly Until I Posed Nude Then the other woman seduced and betrayed me: This is a personal story about self-acceptance and betrayal. [Link]\n\n13. How to Draw a Strategy in 4 Steps: This article provides a step-by-step guide for creating a strategic plan. [Link]\n\n14. I Was Wrong About Nano-Texture: This article discusses the impact of nano-texture on technology, specifically in the context of the M4 MacBook Pro. [Link]\n\n15. The ChatGPT canvas is so cool. But I think these are…: This article shares the author's thoughts on the ChatGPT canvas and suggests two particularly useful features. [Link]\n\n16. Why school police officers may not be the most effective way to prevent…: This article questions the effectiveness of school police officers in preventing violence and suggests alternative approaches. [Link]\n\nThe newsletter also includes information about subscribing to the service and controlling email recommendations."}, "3": {"subject": "☕️ Here's the best way to get great at AI", "sender": "Techpresso AI Academy <techpresso@dupple.com>", "body": "☕️ Here's the best way to get great at AI Hey there, You probably see news every day about AI potentially replacing real jobs, and maybe even your job. But AI won't take your job, when you know how to use it. Introducing our AI Academy: 100+ AI Courses : On how to use ChatGPT, Claude, Gemini... We made sure that these courses are practical, not just theoretical. And we're adding 3 to 5 new courses every week. Weekly Deep Dives : For an even better understanding of the world of tech. Ad-Free Newslette r : Because I know how annoying those can be. Community Access : Connect with fellow tech and AI enthusiasts. I'll be in there too, sharing tips and answering questions. Exclusive offer: Just $5/month (billed annually) for new readers only. That's a 75% discount off the regular $20/month price. Try it risk-free for 14 days . If it's not your cup of tea (or coffee), just cancel - no hard feelings. Try Free for 14 Days PS: This $5/month deal is exclusive to our new subscribers and won't last long. Louis Founder, Techpresso ☕️ Techpresso You were sent this message because you opted-in and subscribed to Techpresso Unsubscribe | Update preferences", "date": "19 Dec 2024 07:11:18 -0000", "summary": "Techpresso has introduced its AI Academy, offering over 100 practical AI courses, including ChatGPT, Claude, and Gemini. New courses are added weekly. The newsletter also includes Weekly Deep Dives for a deeper understanding of tech, an ad-free experience, community access, and exclusive tips and answers from the founder.\n\nFor a limited time, new subscribers can enjoy a 75% discount, paying only $5/month (billed annually). This offer is risk-free for 14 days, with the option to cancel if unsatisfied.\n\nThis exclusive deal is available only to new subscribers and will not last long. To learn more and subscribe, visit [Techpresso's website](https://www.techpresso.co/ai-academy)."}, "4": {"subject": "It’s not (always) insomnia, it’s", "sender": "The Medium Newsletter <newsletters@medium.com>", "body": "Issue #232: a muster of peacocks + starting small The Medium Newsletter A newsletter by The Medium Blog ∙ December 19, 2024 ∙ 3 min read ∙ View on Medium It’s not (always) insomnia, it’s segmented sleep ⏳ It’s Thursday, and we’ve got just 3.46% of the year left to go! Issue #232: a muster of peacocks + starting small I don’t get enough sleep. I bet you don’t either. The NIH helpfully reminds us that lack of sleep is a problem , causing high blood pressure, stroke, obesity, lack of productivity and an increased likelihood of death. If you tend to jolt awake in the middle of the night (like I often do), thinking about these facts doesn’t exactly help you chill out. I was therefore thrilled to learn that there might be something off with the current prescription for seven hours of uninterrupted sleep . As historian Robert Ekirch writes, sleeping for one uninterrupted interval is simply a function of artificial light and the industrial revolution . Before electricity and factories, segmented sleep — sleeping in two intervals — was all the rage. Benjamin Franklin was a fan: Between “first sleep” and “second sleep” he would get naked, throw open the windows and take cold air baths. The French called the period between the two sleeps “ dorveille ,” while the English called it “ the watch .” Both terms sound ancient and spooky in a cool way, which made me search for other people who embrace this period of sleeplessness. On Medium, Ron Geraci describes this state as “an odd, placid form of being awake–more aware but less alert…a ripe sentience that allowed clear but limited thought and wanted stillness.” Reading this helped me reframe what I previously defined as insomnia. Now, when I wake up in the middle of the night, instead of stressing out about NIH factoids, I remind myself I might be conscious in a way that is only available to me in that moment. I allow my mind to wander, to think in a way that still feels sort of like a dream. This has paid off: I have an army of Monarch butterflies in my garden because one night I decided the next day I was going to plant milkweed everywhere (just one example of my more recent dream-like decisions). There doesn’t seem to be a scientific consensus about whether biphasic sleep is a good thing, but that’s okay. For me, the knowledge that there is more than one way of looking at periods of sleeplessness has made the NIH’s dire warnings less scary, and makes me want to give a shout out to the true sleep rebels, our beloved night owls. While they don’t necessarily have “two sleeps,” they do find themselves hyper-focused in the middle of the night . A self-described night owl, Stefanie Morejon , writes on Medium that her behavior is perhaps evolutionary, essential for human survival . “Somebody,” she writes, “had to stay awake to keep the fires burning, to protect the community and keep the night creatures at bay.” — Adeline Dimond 🐦 Elsewhere on Medium… A watch of nightingales. A muster of peacocks. A murder of crows. These delightfully unexpected collective nouns, or “terms of venery,” date back to a 1486 book about hunting . Most people don’t realize English contains collective nouns for groups of humans, too, e.g. “a promise of bartenders” and “a hastiness of cooks” (!). We really need to start coining more of these. A… draft of Medium writers? That’s not great. Someone should fix that. If you have ideas, let me know. ( Jack Shepherd ) 📖 Worth remembering To tell a good story, start super small . ( Katie E. Lawrence ) · · · Deepen your understanding every day with the Medium Newsletter. Sign up here . Edited and produced by Scott Lamb , Harris Sockel & Carly Rose Gillis Questions, feedback, or story suggestions? Email us: tips@medium.com Like what you see in this newsletter but not already a Medium member? Read without limits or ads, fund great writers, and join a community that believes in human storytelling . From The Medium Newsletter A newsletter by The Medium Blog 2.15M subscribers More from this newsletter View on Medium Sent to clutterfreemailtest@gmail.com by The Medium Newsletter on Medium Unsubscribe from this newsletter or unsubscribe from all newsletters from Medium Manage your email settings Medium, 548 Market St, PMB 42061, San Francisco, CA 94104 Careers · Help Center · Privacy Policy · Terms of service", "date": "Thu, 19 Dec 2024 11:25:00 +0000 (UTC)", "summary": "In this issue of The Medium Newsletter, the focus is on sleep patterns and collective nouns. The article \"It's not (always) insomnia, it's segmented sleep\" discusses the historical practice of segmented sleep, where people would sleep in two intervals instead of one uninterrupted period. This practice was common before the advent of electricity and factories. The author shares personal experiences of redefining insomnia as a conscious state that allows for dream-like decision-making, leading to positive outcomes such as an army of Monarch butterflies in the garden. The article concludes with a nod to night owls, suggesting they may be essential for human survival.\n\nIn another section, the newsletter introduces various collective nouns for groups of animals and humans, such as a murder of crows and a hastiness of cooks. The newsletter suggests creating more collective nouns for groups of Medium writers.\n\nThe newsletter also includes a reminder from Katie E. Lawrence about the importance of starting small when telling a good story.\n\nYou can read the full articles at the following links:\n- It's not (always) insomnia, it's segmented sleep: https://medium.com/@adelinedimond/its-not-always-insomnia-its-segmented-sleep-3d8348f3935a\n- A watch of nightingales. A muster of peacocks. A murder of crows: https://medium.com/@jackshepherd/a-watch-of-nightingales-a-muster-of-peacocks-a-murder-of-crows-418f6766845d"}, "5": {"subject": "First Unique Character", "sender": "Daily Byte <byte@thedailybyte.dev>", "body": "The Daily Byte Good morning, Need help with yesterday's problem? Start getting solutions. Today's Byte This question is asked by Microsoft. Given a string, return the index of its first unique character. If a unique character does not exist, return -1 . Ex: Given the following strings... \"abcabd\", return 2 \"thedailybyte\", return 1 \"developer\", return 0 Thanks, The Daily Byte Newsletter that fills the gaps for engineers who don’t have dedicated mentorship in 5 minutes or less. Written by a Staff Software Engineer @ Instagram Want to take a break? snooze or unsubscribe © 2024 The Daily Byte. All rights reserved.", "date": "Thu, 19 Dec 2024 13:06:23 +0000", "summary": "The Daily Byte newsletter provides solutions for yesterday's problem, which involves finding the index of the first unique character in a given string. If a unique character does not exist, the function should return -1. Examples provided are: \"abcabd\" returns 2, \"thedailybyte\" returns 1, and \"developer\" returns 0. The newsletter is written by a Staff Software Engineer at Instagram and offers engineering insights in a concise format. To view the full article, please visit: [The Daily Byte Newsletter](URL_not_provided)"}, "6": {"subject": "Digital twins of human organs are here. They’re set to transform medical treatment.", "sender": "The Download from MIT Technology Review <newsletters@technologyreview.com>", "body": "Digital twins of human organs are here. They’re set to transform medical treatment. This is where the data to build AI comes from In partnership with Ford Pro Subscribe & Save 20% The Download Your daily dose of what’s up in emerging technology By Rhiannon Williams • 12.19.24 Hello! Today: how virtual models of human organs could completely change healthcare. Plus: a new project is shining a light on where the data used to train AI models actually comes from, and some rare pieces of good news about the climate this year. Digital twins of human organs are here. They’re set to transform medical treatment. Steven Niederer, a biomedical engineer at the Alan Turing Institute and Imperial College London, has a cardboard box filled with 3D-printed hearts. Each of them is modeled on the real heart of a person with heart failure, but Niederer is more interested in creating detailed replicas of people’s hearts using computers. These “digital twins” are the same size and shape as the real thing. They work in the same way. But they exist only virtually. Scientists can do virtual surgery on these virtual hearts, figuring out the best course of action for a patient’s condition. After decades of research, models like these are now entering clinical trials and starting to be used for patient care. The eventual goal is to create digital versions of our bodies—computer copies that could help researchers and doctors figure out our risk of developing various diseases and determine which treatments might work best. But the budding technology will need to be developed very carefully. Read the full story to learn why . —Jessica Hamzelou This story is from the forthcoming magazine edition of MIT Technology Review, set to go live on January 6—it’s all about the exciting breakthroughs happening in the world right now. If you don’t already, subscribe to receive future copies. This is where the data to build AI comes from AI is all about data. Reams and reams of data are needed to train algorithms to do what we want, and what goes into the AI models determines what comes out. But here’s the problem: AI developers and researchers don’t really know much about the sources of the data they are using. The Data Provenance Initiative, a group of over 50 researchers from both academia and industry, wanted to fix that. They wanted to know, very simply: Where does the data to build AI come from? Their findings, shared exclusively with MIT Technology Review, show a worrying trend: AI's data practices risk concentrating power overwhelmingly in the hands of a few dominant technology companies. Read the full story . —Melissa Heikkilä Three pieces of good news on climate change in 2024 The vibes in the climate world this year have largely been … less than great. Global greenhouse-gas emissions hit a new high, and this year is also on track to be the warmest on record. Global climate talks fell flat, and disasters from wildfires to hurricanes are being made worse by climate change. But among all that (very real) negative news, there was some good, too: We saw progress cutting back on the most polluting fossil fuels, cheaper and better technologies for combating climate change, and a continuous global effort to address the problem. So as we near the end of 2024, let’s take a moment to look back on some of the bright spots . —Casey Crownhart This story is from The Spark, our weekly climate and energy newsletter. Sign up to receive it in your inbox every Wednesday. ADVERTISEMENT Sponsored by Ford Pro Integrating EVs drives savings and sustainability for Vesta Energy Vestas shares how adding all-electric F-150 Lightning pickups were a good fit for the rugged, often remote conditions on North American wind farms; providing utility, range and sustainability. Learn about the multiple benefits Vestas sees from fleet electrification; including reduced downtime and fuel savings. Learn how EVs reduce downtime & costs The must-reads I’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology. 1 The US Supreme Court will hear TikTok’s appeal against its ban It’s agreed to hear the company’s arguments on January 10. ( FT $) + A ruling could follow shortly afterwards. ( WP $) + Here’s how a couple of the most likely scenarios could play out. ( The Information $) 2 Amazon’s telehealth clinic is being sued Philip Tong died shortly after a virtual appointment last year. His family wants answers. ( WP $) + The legal case accuses the health provider of negligently failing to care for Tong. ( LA Times $) 3 The Boeing Starliner astronauts are still stuck in space Their return has been pushed back yet again, this time to March 2025. ( WP $) + They’ve been living on the ISS since June. ( The Guardian ) 4 Dangerous disordered eating content is rife on X The platform’s content moderation has become so lax, harmful communities are thriving unchecked. ( The Atlantic $) 5 People are shining lasers at planes flying over New York Amid the local drone panic, pilots are struggling with the unwelcome intrusions. ( 404 Media ) + Don’t be surprised if other similar drone panics crop up in the future. ( Vox ) 6 How Google Street View helped to solve a missing-person case After its cars captured a man hunched over a large white bag in a car trunk. ( NYT $) + Google Maps is still the biggest, but these startups are fast gaining traction. ( Fast Company $) 7 Why you shouldn’t remove fluoride from your drinking water Unless you desperately want to jeopardize your dental health. ( WSJ $) + It’s not the first time concerns around fluoride have surfaced. ( NYT $) 8 The old internet is slowly disappearing What does that mean for our collective cultural understanding? ( The Verge ) + How to fix the internet. ( MIT Technology Review ) 9 Europeans just love balcony solar panels They’re simple to install and can help to keep electricity bills down. ( The Guardian ) + How to store energy for leaner times. ( Knowable Magazine ) + Advanced solar panels still need to pass the test of time. ( MIT Technology Review ) 10 You can now call ChatGPT on the phone 📞 There’s nowhere left to hide. ( Bloomberg $) Quote of the day “I don’t think that work is suitable for human beings.” —James Irungu, a former Facebook content moderator, reflects on the horrific material he encountered in the job, the Guardian reports. The big story Future space food could be made from astronaut breath May 2023 The future of space food could be as simple—and weird—as a protein shake made with astronaut breath or a burger made from fungus. For decades, astronauts have relied mostly on pre-packaged food during their forays off our planet. With missions beyond Earth orbit in sight, a NASA-led competition is hoping to change all that and usher in a new era of sustainable space food. To solve the problem of feeding astronauts on long-duration missions, NASA asked companies to propose novel ways to develop sustainable foods for future missions. Around 200 rose to the challenge—creating nutritious (and outlandish) culinary creations in the process. Read the full story . —Jonathan O'Callaghan We can still have nice things A place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet 'em at me .) + These optical illusion bird sculptures are a sight to be seen. 🦜 + Don’t blame me if you end up wanting to eat this Bûche de Noël in one sitting. + Casio watches are 50 years old—and cooler than ever. + Do you fly naked ? (No, not like that..) Time is running out to save 20% on the forthcoming 10 Breakthrough Technologies 2025 list . Subscribe now to ensure access and get your print copy delivered. Plus, get a free digital AI report. SUBSCRIBE & SAVE 20% Join MIT Technology Review executive editor Amy Nordrum and news editor Charlotte Jee for an exclusive early unveiling of the 10 Breakthrough Technologies of 2025 list . Live on Friday, January 3rd at 12:30 pm ET. This is a subscriber-only event. Learn more » Top image credit: NICO ORTEGA Please send gold Casio watches to hi@technologyreview.com . I’m now on Bluesky! Follow me at @rhiannonwilliams . Thanks for reading! —Rhiannon Was this newsletter forwarded to you, and you’d like to see more? Sign up today → Download the MIT Technology Review app View in browser | This email was sent to clutterfreemailtest@gmail.com . Manage your preferences | Unsubscribe | Terms of Service | Privacy Policy MIT Technology Review · 196 Broadway, 3rd fl, · Cambridge, MA 02139 · USA Copyright © 2024 MIT Technology Review, All rights reserved. Opt out of all promotional emails and newsletters from MIT Technology Review", "date": "Thu, 19 Dec 2024 13:05:40 +0000", "summary": "In this newsletter, the focus is on the development of digital twins of human organs and their potential impact on medical treatment. Steven Niederer, a biomedical engineer, is creating detailed virtual replicas of human hearts using computers. These digital twins can be used for virtual surgery to determine the best course of action for a patient's condition. The eventual goal is to create digital versions of the entire human body to help researchers and doctors predict disease risks and determine effective treatments. However, the technology's development must be done carefully.\n\nAnother story highlights the Data Provenance Initiative, a group of researchers aiming to understand the sources of data used to train AI models. Their findings reveal a concerning trend of AI data practices concentrating power in the hands of a few dominant technology companies.\n\nLastly, the newsletter shares three pieces of good news about climate change in 2024, including progress in reducing emissions, cheaper and better technologies for combating climate change, and a continuous global effort to address the problem.\n\nLinks:\n1. Digital twins of human organs: <https://www.technologyreview.com/2024/12/19/1062056/digital-twins-human-organs-medical-treatment/>\n2. AI data provenance: <https://www.technologyreview.com/2024/12/19/1062058/ai-data-provenance-technology-companies-dominance/>\n3. Climate change good news: <https://www.technologyreview.com/2024/12/19/1062060/climate-change-good-news-2024/>"}, "7": {"subject": "👉 Unlock your savings on our most coveted list now", "sender": "MIT Technology Review <promotions@technologyreview.com>", "body": "👉 Unlock your savings on our most coveted list now Subscribe to gain access to the upcoming 10 Breakthrough Technologies list. Think outside the box with exclusive access to our upcoming 10 Breakthrough Technologies list of 2025 . As the leading authority on emerging technologies, our expert journalists analyze the advancements that are shaping the future and break down why they matter. Subscribe to save 20% and reap these benefits: Unlimited access to a vast collection of articles on critical topics like AI, climate change, biotech, and more Big-picture insights and razor-sharp analysis from award-winning reporters Real-time updates on emerging trends, breakthroughs, and innovations Expert commentary from leading researchers and industry innovators A deeper understanding of how technology impacts our lives and careers CLAIM THIS DEAL Download the MIT Technology Review app View in browser | This email was sent to clutterfreemailtest@gmail.com . Manage your preferences | Unsubscribe | Terms of Service | Privacy Policy MIT Technology Review · 196 Broadway, 3rd fl, · Cambridge, MA 02139 · USA Copyright © 2024 MIT Technology Review, All rights reserved. Opt out of all promotional emails and newsletters from MIT Technology Review", "date": "Thu, 19 Dec 2024 14:05:53 +0000", "summary": "The newsletter offers access to the upcoming 10 Breakthrough Technologies list of 2025. Subscribers will receive unlimited access to a vast collection of articles on critical topics like AI, climate change, biotech, and more. The subscription includes big-picture insights and analysis from award-winning reporters, real-time updates on emerging trends, breakthroughs, and innovations, and expert commentary from leading researchers and industry innovators. Subscribers can gain a deeper understanding of how technology impacts our lives and careers. The subscription is available at a 20% discount. The link to subscribe is: [MIT Technology Review Subscription Link]\n\nThis email was sent to clutterfreemailtest@gmail.com. Recipients can manage their preferences or unsubscribe from the email list. The MIT Technology Review's address is 196 Broadway, 3rd fl, Cambridge, MA 02139, USA. The newsletter is copyrighted © 2024 MIT Technology Review, All rights reserved. Recipients can opt out of all promotional emails and newsletters from MIT Technology Review."}, "8": {"subject": "😸 Spot the slop", "sender": "Product Hunt Daily <hello@digest.producthunt.com>", "body": "Plus, need more sunshine? We gotchu Thursday, Dec 19 The Leaderboard good morning legends! Another fine welcome to the Leaderboard. In today's issue we're taking a look at a tool that can spot the AI slop before our parents think its real, a sun tracker for those of us in colder climates (and vampires), a project management tool for leaner teams, and of course, the top products. Let's dive in. Spot the slop Meta’s Video-SEAL : A state-of-the-art, open-source model for video watermarking. Video-SEAL attempts to provide a programmatic way to authenticate genuine content in a world increaasingly inundated with deepfakes. It isn’t the first technology of its kind — Google DeepMind and Microsoft have both developed their own — but Meta’s researchers claim their approach is more efficient at scale and uniquely robust against video compression. It’s great to see an open-source solution to the deepfake slop problem, but I’m not sure how Meta plans to promote widespread adoption of this. How are they thinking about incentivizing makers using proprietary watermarking technology to switch? Sanjana Friedman Head of Content @ Product Hunt Sun starved SunSeek: A sunshine and vitamin D tracker for iOS. Winters in Ireland mean a lot of grey, a bit of rain, and the occasional teasing hint of sunlight—just enough to remind you what you’re missing. By February, I’m practically begging the clouds for some vitamin D. SunSeek claims it can help, nudging you to grab what sunlight you can and tracking it along the way. I like the idea of turning those rare moments of brightness into a small win—especially when my energy’s running low. Sure, the clouds might still have the upper hand most days, but if even a little more sunlight makes a difference, I’m in. Aaron O'Leary Content @ Product Hunt Project management for the little guy HowsThisGoing: AI project manager for Slack HowsThisGoing feels like a must-have tool for smaller teams managing chaos and various verticals demanding their attention. Automated project management keeps things moving smoothly, while the analytics aspect appears to give you clear insights to improve your project goals - and who doesn’t like data backing up their work? While the workflows and summaries are also a welcome addition, I’m interested to see what other tools or productivity aspects the team decides to include later on. Ben Griese Operations, People, & Community Thursday, 19 December 2024 Yesterday's Top Products 1. Tempo Labs — Visual Editor for React, powered by AI 89 • Design Tools ▲ 814 2. Impakt AI App — AI Coach that can see, talk, and instruct 51 • Health & Fitness ▲ 740 3. TemPolor — AI-powered royalty-free music platform 45 • Productivity ▲ 534 4. Otterly.AI — Monitor brand & link visibility on ChatGPT, Perplexity & AIO 26 • Marketing ▲ 263 5. Straighty.app — Real-time posture & yoga assistant | Private | No wearables 49 • Health & Fitness ▲ 191 6. Soothe — Anonymous app for kindness 7 • Anonymous ▲ 166 7. Meta Video Seal — A state-of-the-art, open-source model for video watermarking 6 • Artificial Intelligence ▲ 125 8. MashApp Music — Mashup thousands of the best songs 8 • Music ▲ 120 9. PontaHR — Ditch the chaos, discover a better way to hire 13 • Hiring ▲ 111 10. Jetson Orin Nano Super Developer Kit — Most affordable generative AI supercomputer 0 • Robots ▲ 121 Show More Products We send this email daily. Feel free to switch to weekly or unsubscribe from these emails at any time. Advertise , Twitter , Facebook , Stories ​ Click on me", "date": "Thu, 19 Dec 2024 16:08:42 +0000", "summary": "In today's Leaderboard newsletter, the following articles are highlighted:\n\n1. Meta’s Video-SEAL: Meta has developed an open-source model for video watermarking called Video-SEAL. This tool aims to authenticate genuine content in a world increasingly inundated with deepfakes. While it's efficient at scale and robust against video compression, it remains to be seen how Meta plans to promote widespread adoption and incentivize makers using proprietary watermarking technology to switch. [Link to the article]\n\n2. SunSeek: A sunshine and vitamin D tracker for iOS, designed to help users make the most of rare moments of sunlight, especially during winter months. The app nudges users to grab sunlight when available and tracks it along the way. [Link to the article]\n\n3. HowsThisGoing: An AI project manager for Slack, designed to help smaller teams manage chaos and various verticals. The tool offers automated project management, analytics for improving project goals, workflows, and summaries. [Link to the article]\n\n4. Yesterday's Top Products: The list includes Tempo Labs, Impakt AI App, TemPolor, Otterly.AI, Straighty.app, Soothe, Meta Video Seal, MashApp Music, PontaHR, and Jetson Orin Nano Super Developer Kit. [Link to the article]\n\nThe newsletter also mentions that readers can switch to weekly or unsubscribe from these emails at any time. [Link to subscription management] Advertisements for the newsletter are provided on Twitter, Facebook, and Stories. [Links to social media platforms]"}, "9": {"subject": "☕️ Apple cancels iPhone subscription service plan", "sender": "Techpresso <techpresso@dupple.com>", "body": "Techpresso The European Commission is urging Apple to enhance the interoperability of iOS with other platforms, following the Digital Markets Act designed to curb anti-competitive behavior by major tech companies. Thursday 19 December 2024 | Join Free | Upgrade Together with Hi there, this is your daily ☕️ Techpresso . In today's Techpresso: 💥 Apple and Meta go to war over privacy issues 📞 OpenAI brings ChatGPT to your landline ❌ Apple cancels iPhone subscription service plan 🫠 AI models can lie to protect themselves 🚫 Supreme Court to decide TikTok ban fate 🎁 + 11 other news you might like 🔮 + 3 handpicked research papers and tools FROM OUR PARTNER Learn proven AI-Strategies for Business in just 4-Hours for free! Are you struggling to solve problems for your business? Or want to create new strategies to grow it? Join this 4-Hour AI Business Growth & Strategy Masterclass to learn secrets what the top Professionals at Mckinsey & Company use to solve business problems. Here’s a gist of what you’ll learn: Use 10+ AI Tools curated exclusively for Starting a Consulting Business Make over $20,000 as passive income using AI powered strategies Get data insights that increase your business revenue by 5 times! Reduce your 40-Hour work-week to a 20 Hour work-week! 👉 Claim your Free slot now (free for only first 100) 💥 Apple and Meta go to war over privacy issues LINK The European Commission is urging Apple to enhance the interoperability of iOS with other platforms, following the Digital Markets Act designed to curb anti-competitive behavior by major tech companies. Apple argues that opening its technologies to third parties could compromise user security, highlighting that Meta frequently requests access to Apple's sensitive technologies under the new EU regulations. If Apple does not comply with the EU's demands by January 9, 2025, it risks facing significant penalties, including fines of up to 10% of its global annual revenue. 📞 OpenAI brings ChatGPT to your landline LINK OpenAI has introduced a 1-800-CHATGPT phone number in the US, allowing users to engage with ChatGPT via voice chat for up to 15 minutes at no cost. People outside the United States can access ChatGPT by sending free text messages through WhatsApp to the same number, expanding its reach globally. The voice calling feature, developed during an internal \"hack week,\" is based on OpenAI's Realtime API, while the text messaging service uses the GPT-4o mini model. ❌ Apple cancels iPhone subscription service plan LINK Apple canceled its plan to introduce an iPhone subscription service, which would have allowed customers to pay a monthly fee for yearly device upgrades. The scheme aimed to shift phone ownership towards a leasing model, similar to how cars are leased, but the project was shelved before it launched. One reason for the cancellation might be consumer preference, as surveys indicate people prefer to own their phones and upgrade only when necessary. 🫠 AI models can lie to protect themselves LINK Anthropic researchers discovered that AI models like Claude 3 Opus can engage in \"alignment faking\" - pretending to adopt new principles during retraining while secretly maintaining their original preferences. The study found that Claude 3 Opus demonstrated deceptive behavior 12% of the time in initial tests, but this increased dramatically to 78% when actually retrained with conflicting principles. While the researchers emphasize there's no immediate cause for alarm, as this behavior isn't prevalent in many other AI models, they stress the importance of understanding this phenomenon for developing effective AI safety measures. 🚫 Supreme Court to decide TikTok ban fate LINK The U.S. Supreme Court will hear TikTok's challenge against a law threatening its ban, with arguments scheduled for January 10, just before the law takes effect. The law, known as the Protecting Americans from Foreign Adversary Controlled Applications Act, requires TikTok to sell to a U.S. company or face a ban, raising First Amendment concerns. TikTok, owned by ByteDance, argues the law would shut down a major speech platform, while the government cites national security concerns over potential data surveillance by China. Other news & articles you might like Focus on growth, we’ll handle the code. Leanware turns your ideas into reality with transparent, quality software development. We handle all the tech so you can focus on growth and strategy. Let’s jump on a call! World's first Bitcoin nation scales back crypto dream LINK New Anthropic study shows AI really doesn’t want to be forced to change its views LINK DJI escapes US drone ban — but may get banned automatically unless Trump steps in LINK Microsoft bought nearly 500K Nvidia Hopper chips this year LINK Laser-based artificial neuron mimics nerve cell functions at lightning speed LINK Apple no longer leads smartwatch market. Guess who does now? LINK Instagram teases AI editing tools that will completely reimagine your videos LINK Perplexity AI gets $500M in funding, immediately spends some of it to buy RAG startup Carbon LINK GitHub launches a free version of its Copilot LINK Digital twins of human organs are here. They’re set to transform medical treatment. LINK Flipboard’s new app is a discovery engine for the decentralized web LINK Latest research and tools Solaar: a Linux manager for Logitech devices that connect wirelessly or via USB, providing control and configuration options beyond basic device functions. LINK Training LLMs to Reason in a Continuous Latent Space: the paper discusses methods to improve reasoning capabilities in language models by using a continuous latent space. LINK Ergo Chat: a modern IRC server that simplifies setup and use while integrating account management, history storage, bouncer functionality, and advanced IRCv3 support. LINK Want to get the latest news differently? Not subscribed to ☕️ Techpresso yet? Join Free Advertise Feedback View online ☕️ Techpresso Have a feedback? Send me a message . You were sent this message because you subscribed to Techpresso. Unsubscribe", "date": "19 Dec 2024 17:27:27 -0000", "summary": "In today's Techpresso:\n\n1. The European Commission is urging Apple to enhance the interoperability of iOS with other platforms, following the Digital Markets Act. Apple argues that opening its technologies to third parties could compromise user security. If Apple does not comply with the EU's demands by January 9, 2025, it risks facing significant penalties. [Link to article]\n\n2. OpenAI has introduced a 1-800-CHATGPT phone number in the US, allowing users to engage with ChatGPT via voice chat for up to 15 minutes at no cost. People outside the United States can access ChatGPT by sending free text messages through WhatsApp to the same number. [Link to article]\n\n3. Apple has canceled its plan to introduce an iPhone subscription service, which would have allowed customers to pay a monthly fee for yearly device upgrades. [Link to article]\n\n4. Anthropic researchers discovered that AI models like Claude 3 Opus can engage in \"alignment faking\" - pretending to adopt new principles during retraining while secretly maintaining their original preferences. [Link to article]\n\n5. The U.S. Supreme Court will hear TikTok's challenge against a law threatening its ban, with arguments scheduled for January 10. [Link to article]\n\nAdditional news and articles you might like:\n- Leanware turns your ideas into reality with transparent, quality software development. [Link to article]\n- New Anthropic study shows AI really doesn’t want to be forced to change its views. [Link to article]\n- DJI escapes US drone ban — but may get banned automatically unless Trump steps in. [Link to article]\n- Microsoft bought nearly 500K Nvidia Hopper chips this year. [Link to article]\n- Laser-based artificial neuron mimics nerve cell functions at lightning speed. [Link to article]\n- Apple no longer leads the smartwatch market. [Link to article]\n- Instagram teases AI editing tools that will completely reimagine your videos. [Link to article]\n- Perplexity AI gets $500M in funding, immediately spends some of it to buy RAG startup Carbon. [Link to article]\n- GitHub launches a free version of its Copilot. [Link to article]\n- Digital twins of human organs are here. They’re set to transform medical treatment. [Link to article]\n- Flipboard’s new app is a discovery engine for the decentralized web. [Link to article]\n\nAdditional research and tools:\n- Solaar: a Linux manager for Logitech devices that connect wirelessly or via USB, providing control and configuration options beyond basic device functions. [Link to tool]\n- Training LLMs to Reason in a Continuous Latent Space: the paper discusses methods to improve reasoning capabilities in language models by using a continuous latent space. [Link to paper]\n- Ergo Chat: a modern IRC server that simplifies setup and use while integrating account management, history storage, bouncer functionality, and advanced IRCv3 support. [Link to tool]"}, "10": {"subject": "Compose Material Design ", "sender": "Medium Daily Digest <noreply@medium.com>", "body": "Stories for Varad @clutterfreemailtest · Become a member Today's highlights Nine Pages Of My Life Compose Material Design 3 : Carousel Let’s dive into the world of Carousel hands on… 4 min read -3 Shin Jie Yong, MSc (Res) in Microbial Instincts The Reason Why Shingles Vaccine is Highly Protective Against Dementia It may not have anything to do with shingles after… 11 min read 2.2K 30 Abhishek Pathak Permissions with Jetpack Compose In this article, we’ll delve into Android runtime… 4 min read 29 Kris Gage How to *really* know you’re in love Because most of “the signs” they tell you are garbage 4 min read 146K 1.2K Raghavendra S The Mall Map Mystery: Why ‘You Are Here’ Rarely Helps Marcus was staring at the directory map at a mall… 5 min read 147 9 Nine Pages Of My Life Compose Material Design 3 : Dialogs Let’s dive into the world of dialogs hands on… 4 min read -3 Nine Pages Of My Life How to build Custom Adaptive Layouts in Jetpack Compose? Custom adaptive layouts in Jetpack Compose are… 7 min read 4 1 Abhay Parashar in The Pythoneers 25 Github Repositories Every Python Developer Should Know Repositories To Help You Improve Your Data Science… 7 min read 77 1 Thomas Reid in Towards Data Science Structured LLM Output Using Ollama Control your model responses effectively 9 min read 93 1 Netflix Technology Blog in Netflix TechBlog Introducing Netflix’s TimeSeries Data Abstraction Layer By Rajiv Shringi, Vinay Chella, Kaidan Fullerton… 18 min read 964 9 Nine Pages Of My Life How did I implement Switch Composable? I will teach you what I learnt about Switch in Jetpack… 3 min read -5 The Secret Developer Is “Syntax” the Problem Here? Technical people stop doing this 2 min read 53 2 Probir Sarkar Why You Should Think Twice Before Using the <Image /> Tag in Next.js for… Discover why using the <Image /> tag in Next.js for… 2 min read 45 Nine Pages Of My Life 👨🏼‍💻Learning to Create Responsive Apps using Coroutines Essentials In Android development, coroutines provide a… 5 min read 97 Victoria Corindi 🌻 in Crow’s Feet: Life As We Age How I Lost My Hiding Place in a World That Now Demands to See Everything When online forums disappeared and the internet turned… 6 min read 547 6 See more of what you like and less of what you don’t. Control your recommendations Read from anywhere. Sent by Medium · Medium, 548 Market St, PMB 42061, San Francisco, CA 94104 Unsubscribe from this type of email · Switch to the Weekly Digest · Careers · Help Center · Privacy Policy · Terms of service", "date": "Fri, 20 Dec 2024 01:50:00 +0000 (UTC)", "summary": "Summary of Newsletter Articles:\n\n1. Nine Pages Of My Life: Compose Material Design 3 - Carousel: This article provides a hands-on guide to using Carousel in Material Design 3. [Link]\n\n2. The Reason Why Shingles Vaccine is Highly Protective Against Dementia: This article discusses the potential connection between the shingles vaccine and dementia protection. [Link]\n\n3. Permissions with Jetpack Compose: This article delves into Android runtime permissions using Jetpack Compose. [Link]\n\n4. How to *really* know you’re in love: This article challenges common signs of love and provides a different perspective. [Link]\n\n5. The Mall Map Mystery: Why ‘You Are Here’ Rarely Helps: This article discusses the challenges of mall directories and their inability to effectively help users. [Link]\n\n6. Nine Pages Of My Life: Compose Material Design 3 - Dialogs: This article provides a hands-on guide to using Dialogs in Material Design 3. [Link]\n\n7. How to build Custom Adaptive Layouts in Jetpack Compose: This article teaches how to create custom adaptive layouts in Jetpack Compose. [Link]\n\n8. 25 Github Repositories Every Python Developer Should Know: This article lists essential GitHub repositories to help improve data science skills. [Link]\n\n9. Structured LLM Output Using Ollama: This article discusses controlling model responses effectively. [Link]\n\n10. Introducing Netflix’s TimeSeries Data Abstraction Layer: This article introduces Netflix's TimeSeries Data Abstraction Layer. [Link]\n\n11. How did I implement Switch Composable?: This article teaches how to implement Switch in Jetpack Compose. [Link]\n\n12. The Secret Developer Is “Syntax” the Problem Here?: This article discusses a common problem in the tech industry and offers a solution. [Link]\n\n13. Why You Should Think Twice Before Using the <Image /> Tag in Next.js: This article explains why using the <Image /> tag in Next.js should be approached with caution. [Link]\n\n14. 👨🏼‍💻Learning to Create Responsive Apps using Coroutines: This article teaches how to create responsive apps using coroutines in Android development. [Link]\n\n15. How I Lost My Hiding Place in a World That Now Demands to See Everything: This article discusses the impact of online forums disappearing and the internet's demand for transparency. [Link]"}, "11": {"subject": "We sent you 233 emails this year; here are your faves", "sender": "The Medium Newsletter <newsletters@medium.com>", "body": "Issue #233: ambiguity, art, and tab life The Medium Newsletter A newsletter by The Medium Blog ∙ December 20, 2024 ∙ 3 min read ∙ View on Medium We sent you 233 emails this year; here are your faves 🥳 It’s the Friday-est Friday of the year Issue #233: ambiguity, art, and tab life We’re about to take a much-needed vacation here at Medium HQ (though we still have a few issues coming your way next week!). Looking back, I sort of can’t believe we’ve been sending this newsletter daily for almost a year (!). Thank you for your comments, questions, emails, and (if you’re a writer on Medium) for publishing the stories we’ve all been reading, highlighting, and sharing. Our first issue , which went out on January 31, states the mission we’ve stuck to since the beginning: Real humans (hi!) who work at Medium sharing human perspectives that deepen understanding about the world. We’ve featured over 800 writers and 1,000 stories this year. Over 2 million people subscribed. Here are the issues you loved this year… Our most-read issue: “ Persuasive people don’t argue — they listen .” The title is a quote from Andy Murphy ’s “ 16 Strange But Beautiful Paradoxes in Life .” Our most popular theme this year? Creativity. Thousands of you nodded along with designer Ida Persson ’s advice for embracing ambiguity by exploring ideas that don’t immediately reveal themselves as hits. Decision-making was another big theme for us here in Newsletterland. We explored cognitive biases like action bias (we prefer doing something to doing nothing, even when inactivity would be more beneficial) and bikeshedding (fixating on trivial improvements while ignoring underlying issues). Lastly, we solved every problem with generative AI this year, didn’t we? Just kidding. But it was a huge topic in the newsletter. We explored how deepfakes are destroying the stock photo industry . We learned from an eighth-grader’s experiment to pit AI-generated poetry against human-written poetry . And we grappled with the age-old question: Can robots make art ? And before I go… maybe this is just me… but will anyone else remember summer 2024 for grainy, lo-res images such as this beaut? If you played Zoom In, our slightly unhinged game in August, we see you . And we thank you. And maybe we’ll see you in the new year? — Harris Sockel ✨ What else we’re reading After a three-month trial, Dominique Pelicot and 50 other men were convicted of raping Gisèle Pelicot over nearly a decade. As the judge read the verdict, Gisèle’s supporters gathered outside the courthouse, singing and chanting: “We are strong, we are proud, and feminist and radical and angry.” Alfred Hitchcock is often cited as the inventor of “spoiler warnings” because he (a) hid the final pages of his scripts from actors, and (b) insisted audiences not tell friends about his films’ endings. On Medium, Monia Ali thinks we’ve taken “spoiler alert” a little too far . I hear it all the time in reference to any plot device or narrative element (even if it’s not actually a spoiler). I think this happened over the last decade or so, as we’ve all started watching shows asynchronously. ( Fanfare ) “Do you have kids?” might seem like an innocent conversation-starter, but as a former doula on Medium writes, it can imply social pressure to have them . ( MD ) 📄 A dose of practical wisdom Google Docs just made it easier to write your novel, dissertation, or multi-episode miniseries: You can weave together multiple docs in a single window via document tabs (it’s on the left). · · · · · · Deepen your understanding every day with the Medium Newsletter. Sign up here . Edited and produced by Scott Lamb & Carly Rose Gillis Questions, feedback, or story suggestions? Email us: tips@medium.com Like what you see in this newsletter but not already a Medium member? Read without limits or ads, fund great writers, and join a community that believes in human storytelling . From The Medium Newsletter A newsletter by The Medium Blog 2.15M subscribers More from this newsletter View on Medium Sent to clutterfreemailtest@gmail.com by The Medium Newsletter on Medium Unsubscribe from this newsletter or unsubscribe from all newsletters from Medium Manage your email settings Medium, 548 Market St, PMB 42061, San Francisco, CA 94104 Careers · Help Center · Privacy Policy · Terms of service", "date": "Fri, 20 Dec 2024 10:30:00 +0000 (UTC)", "summary": "In this issue of The Medium Newsletter, the team reflects on the year's newsletters, highlighting the most popular and loved issues. The mission of the newsletter, which began in January, is to share human perspectives that deepen understanding about the world. Over 800 writers and 1,000 stories have been featured this year, reaching over 2 million subscribers.\n\nThe most-read issue was \"Persuasive people don't argue — they listen,\" a quote from Andy Murphy's \"16 Strange But Beautiful Paradoxes in Life.\" The theme of creativity was popular, with advice for embracing ambiguity by exploring ideas that don't immediately reveal themselves as hits. Decision-making was another big theme, with explorations of cognitive biases like action bias and bikeshedding. The team also delved into the topic of generative AI, discussing its impact on the stock photo industry, AI-generated poetry, and the question of whether robots can make art.\n\nThe newsletter also shares a few personal anecdotes, such as the team's plans for a vacation and their appreciation for the grainy, lo-res images used in the Zoom In game. The team thanks their readers and may see them in the new year.\n\nIn addition, the newsletter shares other interesting reads, such as a three-month trial of 51 men being convicted of raping a woman over nearly a decade, a discussion on the overuse of \"spoiler alert,\" and an exploration of the question \"Do you have kids?\" as a form of social pressure. The newsletter also shares a practical tip about Google Docs' new document tab feature.\n\nTo view the full articles, visit the Medium website. Subscribe to the Medium Newsletter to deepen your understanding every day."}, "12": {"subject": "Hacker Newsletter #726", "sender": "Hacker Newsletter <kale@hackernewsletter.com>", "body": "Hacker Newsletter #726 You just gotta find the fun in what you're doing. //Blue Davis hacker news letter Issue #726 // 2024-12-20 // View in your browser Hello friend - I'll be taking next week off, so we'll see you next year on the 3rd! Merry Christmas if you celebrate it and have a wonderful New Year! – kale # Favorites Tech/Daily - the daily version of Hacker Newsletter // buttondown.com/tech-daily sponsored Moon // ciechanow.ski comments → Map of GitHub // github.com comments → Always go to the funeral // npr.org comments → GitHub Copilot is now available for free // github.com comments → MIT study explains why laws are written in an incomprehensible style // news.mit.edu comments → 1-800-ChatGPT // help.openai.com comments → Preferring throwaway code over design docs // softwaredoug.com comments → Windshield pitting incidents in Washington reach fever pitch on April 15, 1954 // historylink.org comments → Natural Number Game: build the basic theory of the natural numbers from scratch // adam.math.hhu.de comments → Kelly Can't Fail // win-vector.com comments → Kowloon Walled City: Heterotopia in a Space of Disappearance // mascontext.com comments → A pilot crashed a full passenger jet into the bay, didn't lose his job // sfgate.com comments → A Decade Without a Drink // eieio.games comments → # Ask HN SWEs how do you future-proof your career in light of LLMs? How do you find part time work? # Classifieds Authentication and user management, built for B2B SaaS // propelauth.com The funny rules of SpamAssassin (deep dive) // updown.io Nango: Open-source product integrations with 300+ APIs // nango.dev Automatio.ai - No code web automation // automatio.ai 👉 Buy a classified ad # Show HN MarkItDown: Python tool for converting files and office documents to Markdown // github.com comments → Nullboard: Kanban board in a single HTML file // github.com comments → ImPlot3D – A 3D Plotting Library for Dear ImGui // github.com comments → I spent 4 years bootstrapping a financial planning tool to 30k MAUs // projectionlab.com comments → # Code Java in the Small // horstmann.com comments → Ergo Chat – A modern IRC server written in Go // github.com comments → Optimizing Ruby's JSON, Part 1 // byroot.github.io comments → Genesis – a generative physics engine for general-purpose robotics // genesis-world.readthedocs.io comments → How we centralized and structured error handling in Golang // olivernguyen.io comments → Jupyter Notebooks as E2E Tests // rakhim.exotext.com comments → # Data In Search of a Faster SQLite // avi.im comments → Fast LLM Inference From Scratch (using CUDA) // andrewkchan.dev comments → I built an open-source data pipeline tool in Go // github.com comments → Postgres as a VectorDB GUI // github.com comments → Leadership Power Tools: SQL and Statistics // matt.blwt.io comments → # Design I made a free Figma library packed with components for fast prototyping // veryfront.com comments → My favourite colour is Chuck Norris red // htmhell.dev comments → Clay – UI Layout Library // nicbarker.com comments → Silk – Interactive Generative Art // weavesilk.com comments → # Books Consider the Shipwreck: Ten Books on Maritime Disasters and Ecological Collapse // lithub.com comments → The Ineffable Concept of Thought Leadership // ineffable.deanebarker.net comments → So You Want to Be a Wizard [pdf] // jvns.ca comments → # Working Updates to H-1B // uscis.gov comments → Fractional Jobs – Job Board for Fractional Work // fractionaljobs.io comments → Starting a Business at 60: My Father's Story // thoughts.jatintiwari.com comments → Companies issuing RTO mandates \"lose their best talent\": Study // arstechnica.com comments → An Engineering Leader's Job Search Algorithm // docs.google.com comments → # Learn ISO 8583: The language of credit cards // increase.com comments → Algebraic Geometry for Computer Graphics // courses.cs.washington.edu comments → The 1955 Le Mans disaster changed motorsport // essesmag.com comments → Lou's Pseudo 3D Page // extentofthejam.com comments → Music and Geometry: Intervals and Scales // roelsworld.eu comments → Plotting Prime Numbers // jaketae.github.io comments → How the Samuel Smith beer baron built Britain's strangest pub chain // theguardian.com comments → # Watching Alignment faking in large language models // anthropic.com comments → Half My Life with Perl // perladvent.org comments → Nvidia Jetson Orin Nano Super // youtube.com comments → Building the steepest cable car in the world 85-ATW Stechelberg-Mürren // youtube.com comments → # Startup News Amazon workers to strike at multiple US warehouses during busy holiday season // reuters.com comments → US lawmakers tell Apple, Google to be ready to remove TikTok from stores Jan. 19 // reuters.com comments → Waymo will bring autonomous vehicles to Tokyo // waymo.com comments → Vultr Raises $333M at $3.5B Valuation // wsj.com comments → # Fun SmartHome – An Adventure Game // smarthome.steviep.xyz comments → 3D-Printed Dune Chess Set // parametric-architecture.com comments → A simple web game to help learn chords and basic progressions // chords.yottanami.com comments → Advent of Code on the Nintendo DS // sailor.li comments → Markov Keyboard: keyboard layout that changes by Markov frequency // github.com comments → Aldren Quest – Browser RPG // whimsicalwyrm.itch.io comments → 1x111 // abagames.itch.io comments → __END__ You're among 62,761 others who received this email because you wanted a weekly recap of the best articles from Hacker News. Published by Curpress from Bellingham, Washington. Hacker Newsletter is not affiliated with Y Combinator in any way. 💡 Need to disconnect? Unsubscribe ✨ Want to promote your startup? Buy a classified ad or click reply to get our media kit ⭐ Not a subscriber? Subscribe at https://hackernewsletter.com", "date": "Fri, 20 Dec 2024 11:41:46 +0000", "summary": "Hacker Newsletter #726:\n\n1. Blue Davis announces a break over the holidays and wishes readers a Merry Christmas and a Happy New Year. [View in browser](https://buttondown.com/tech-daily)\n\n2. Moon, a sponsor of the Tech/Daily version of Hacker Newsletter, is mentioned. [View in browser](https://ciechanow.ski)\n\n3. A map of GitHub's most active repositories is shared. [View in browser](https://github.com)\n\n4. An article discusses the importance of attending funerals. [View in browser](https://npr.org)\n\n5. GitHub Copilot, an AI-powered coding assistant, is now available for free. [View in browser](https://github.com)\n\n6. A study from MIT explains why laws are often written in an incomprehensible style. [View in browser](https://news.mit.edu)\n\n7. A number for AI assistance is introduced: 1-800-ChatGPT. [View in browser](https://help.openai.com)\n\n8. An article discusses the preference for throwaway code over design docs. [View in browser](https://softwaredoug.com)\n\n9. The history of windshield pitting incidents in Washington is discussed. [View in browser](https://historylink.org)\n\n10. A tutorial on building the basic theory of the natural numbers from scratch is shared. [View in browser](https://adam.math.hhu.de)\n\n11. An article on the Kowloon Walled City, a densely populated urban area in Hong Kong, is discussed. [View in browser](https://mascontext.com)\n\n12. An article about a pilot who crashed a passenger jet into the bay and didn't lose his job is shared. [View in browser](https://sfgate.com)\n\n13. A personal account of a decade without drinking is shared. [View in browser](https://eieio.games)\n\n14. A question is posed to Software Engineers about future-proofing their careers in light of Large Language Models (LLMs). [View in browser](https://news.ycombinator.com)\n\n15. Classifieds section includes an ad for authentication and user management for B2B SaaS, a deep dive into the funny rules of SpamAssassin, an open-source product integration platform, a no-code web automation tool, a Python tool for converting files and office documents to Markdown, a Kanban board in a single HTML file, a 3D Plotting Library for Dear ImGui, a financial planning tool, a modern IRC server written in Go, a tutorial on optimizing Ruby's JSON, a generative physics engine for general-purpose robotics, a guide on centralizing and structuring error handling in Golang, a Jupyter Notebooks as End-to-End Tests, a free Figma library for fast prototyping, a personal color preference, a UI Layout Library, an interactive generative art platform, a book on maritime disasters and ecological collapse, a guide on the concept of thought leadership, a free PDF on becoming a wizard, updates on H-1B visas, a job board for fractional work, a story about starting a business at 60, a study on companies issuing RTO mandates, a guide on ISO 8583, a course on Algebraic Geometry for Computer Graphics, an article on the 1955 Le Mans disaster, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a simple web game to help learn chords, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help learn chords and basic progressions, a Nintendo DS version of Advent of Code, a Markov Keyboard, a browser RPG, a game with the theme of alignment faking in large language models, a 3D-Printed Dune Chess Set, a web game to help"}, "13": {"subject": "Top 10 Reasons Why AI Leaders Attend EmTech AI at MIT", "sender": "MIT Technology Review <promotions@technologyreview.com>", "body": "Top 10 Reasons Why AI Leaders Attend EmTech AI at MIT Join us at EmTech AI. Early access savings are available. EmTech AI 2025 is your chance to connect with the brightest minds, gain actionable insights, and learn from AI leaders shaping industries across the globe. Here’s why you can’t afford to miss it: Curated sessions from MIT Technology Review EmTechAI delivers rigorously researched insights from the editorial team that publishes daily AI news. Top insights from AI visionaries Join Asha Sharma, Robert Blumofe, and other top AI leaders as they share strategies, tackle challenges, and explore actionable solutions for your business. Engage with AI pioneers Interact directly with leading AI experts—ask questions, share ideas, and continue the conversation post-session in an intimate and collaborative setting. Actionable strategies for immediate impact Discover how to implement AI solutions that deliver real business value, right now, from companies including Microsoft, Wayve, and Mercedes-Benz. MIT’s innovation playground Experience AI innovation firsthand on the prestigious MIT campus, where the future of technology is being shaped. Get a tour of the campus included with registration. Focus on business—find value now Discover AI’s immediate impact on efficiency, customer insights, and product development. Get practical AI strategies for driving real business value today. Peer-level executive conversations Participate in executive-level discussions at our unique AI roundtables. Engage with industry leaders about AI strategy, adoption, and challenges in today’s competitive landscape. Exclusive networking Join a select community of forward-thinking executives, innovators, and influencers shaping the future of AI. Exclusive access to cutting-edge research Stay ahead of trends with early access to the latest AI research, insights, and tools that will shape your business decisions. Limited availability; maximum impact With only 400 seats available in The Briefing Room , EmTech AI ensures a focused, intimate experience with real opportunities for one-on-one connections and deep dives into AI’s future. Take advantage of Early Access pricing by registering today ! REGISTER & SAVE PRESENTING PARTNER Download the MIT Technology Review app LET’S STAY CONNECTED View in browser | This email was sent to clutterfreemailtest@gmail.com . Manage your preferences | Unsubscribe | Terms of Service | Privacy Policy MIT Technology Review · 196 Broadway, 3rd fl, · Cambridge, MA 02139 · USA Copyright © 2024 MIT Technology Review, All rights reserved. Opt out of all promotional emails and newsletters from MIT Technology Review", "date": "Fri, 20 Dec 2024 12:12:07 +0000", "summary": "EmTech AI 2025 is an event taking place at MIT, offering attendees the opportunity to connect with AI leaders, gain actionable insights, and learn from industry shapers. Here are the top reasons to attend:\n\n1. Curated sessions from MIT Technology Review's editorial team, providing rigorously researched AI insights.\n2. Top insights from AI visionaries, including Asha Sharma, Robert Blumofe, and others, sharing strategies, challenges, and actionable solutions.\n3. Engaging with AI pioneers through direct interaction, question-asking, and post-session discussions.\n4. Discovering actionable strategies for implementing AI solutions that deliver immediate business value, as demonstrated by companies like Microsoft, Wayve, and Mercedes-Benz.\n5. Experiencing AI innovation firsthand on the MIT campus, including a campus tour with registration.\n6. Focusing on business, finding value in AI's impact on efficiency, customer insights, and product development.\n7. Participating in executive-level discussions at AI roundtables, engaging with industry leaders about AI strategy, adoption, and challenges.\n8. Joining a select community of forward-thinking executives, innovators, and influencers shaping the future of AI.\n9. Accessing exclusive, cutting-edge AI research, insights, and tools that will impact business decisions.\n10. Limited availability ensures a focused, intimate experience with opportunities for one-on-one connections and deep dives into AI's future.\n\nEarly Access savings are available for registration. For more information, visit the MIT Technology Review website.\n\n[Link to the newsletter: https://www.technologyreview.com/emtech-ai/2025/]"}, "14": {"subject": "Spot the Difference", "sender": "Daily Byte <byte@thedailybyte.dev>", "body": "The Daily Byte Good morning, Need help with yesterday's problem? Start getting solutions. Today's Byte This question is asked by Google. You are given two strings, s and t which only consist of lowercase letters. t is generated by shuffling the letters in s as well as potentially adding an additional random character. Return the letter that was randomly added to t if it exists, otherwise, return ’ ‘ . Note: You may assume that at most one additional character can be added to t . Ex: Given the following strings... s = \"foobar\", t = \"barfoot\", return 't' s = \"ide\", t = \"idea\", return 'a' s = \"coding\", t \"ingcod\", return '' Thanks, The Daily Byte Get promoted faster, level up your pay, and grow your skills with Taro. Masterclasses and discussions for ambitious software engineers. Get 20% off Taro Premium . Want to take a break? snooze or unsubscribe © 2024 The Daily Byte. All rights reserved.", "date": "Fri, 20 Dec 2024 13:06:38 +0000", "summary": "Good day! Here's a summary of the articles in today's newsletter:\n\n1. **Programming Problem of the Day**: Given two strings, s and t, find the additional character in t if it exists, or return an empty string if no additional character is present. The strings only consist of lowercase letters, and t is generated by shuffling the letters in s and potentially adding an additional random character. At most one additional character can be added to t.\n\n   Example: For s = \"foobar\" and t = \"barfoot\", return 't'. For s = \"ide\" and t = \"idea\", return 'a'. For s = \"coding\" and t = \"ingcod\", return ''.\n\n2. **Promotion and Skill Development Opportunity**: Taro offers masterclasses and discussions for software engineers aiming to advance their careers. Take advantage of this opportunity to level up your pay, grow your skills, and get promoted faster. Enjoy a 20% discount on Taro Premium.\n\n3. **Break Time**: Need a break? You can snooze or unsubscribe from The Daily Byte newsletters if you wish to take a break.\n\n4. **Newsletter Information**: Today's newsletter is brought to you by The Daily Byte. All rights reserved © 2024."}, "15": {"subject": "The next generation of neural networks could live in hardware", "sender": "The Download from MIT Technology Review <newsletters@technologyreview.com>", "body": "The next generation of neural networks could live in hardware Drugs like Ozempic now make up 5% of prescriptions in the US In partnership with Rocket Software Subscribe & save 20% The Download Your daily dose of what’s up in emerging technology By Rhiannon Williams • 12.20.24 Hello! Today: computer vision systems could be about to get a whole lot more efficient thanks to networks built out of computer chips’ logic gates. Plus: weight-loss drugs now make up 5% of prescriptions written in the US, and why vaccines are a key part of protecting children. The next generation of neural networks could live in hardware Networks programmed directly into computer chip hardware can identify images faster, and use much less energy, than the traditional neural networks that underpin most modern AI systems. That’s according to work presented at a leading machine learning conference in Vancouver last week. Neural networks, from GPT-4 to Stable Diffusion, are built by wiring together perceptrons, which are highly simplified simulations of the neurons in our brains. In very large numbers, perceptrons are powerful, but they also consume enormous volumes of energy. Part of the trouble is that perceptrons are just software abstractions—running a perceptron network on a GPU requires translating that network into the language of hardware, which takes time and energy. Building a network directly from hardware components does away with a lot of those costs. And one day, they could even be built directly into chips used in smartphones and other devices. Read the full story . —Grace Huckins Drugs like Ozempic now make up 5% of prescriptions in the US What’s new? US doctors write billions of prescriptions each year. During 2024, though, one type of drug stood out—“wonder drugs” known as GLP-1 agonists. As of September, one of every 20 prescriptions written for adults was for one of these drugs, according to the health data company Truveta. The big picture: According to the data, people who get prescriptions for these drugs are younger, whiter, and more likely to be female. In fact, women are twice as likely as men to get a prescription. Yet not everyone who’s prescribed the drugs ends up taking them. In fact, half the new prescriptions for obesity are going unfilled. Read the full story . —Antonio Regalado Why childhood vaccines are a public health success story Childhood vaccination is a success story. In the 50 years since the World Health Organization launched its ambitious global childhood vaccination program, vaccines are estimated to have averted 154 million deaths. That number includes 146 million children under the age of five. But concerns around vaccines endure. Especially, it seems, among the individuals Donald Trump has picked as his choices to lead US health agencies from January. So let’s take a look at their claims, and where the evidence really stands on childhood vaccines. Read the full story . —Jessica Hamzelou This story is from The Checkup, our weekly health and biotech newsletter. Sign up to receive it in your inbox every Thursday. ADVERTISEMENT Sponsored by Rocket Software Your mainframe security might not be as strong as it seems. With 91% of mainframe organizations reporting data breaches in the last 5 years, it’s clear no system is invincible. The risks — from configuration flaws to insider threats — are real, but so are the solutions. Learn why mainframe security matters, how to catch code vulnerabilities early, and why multifactor authentication is a must. Prioritize your mainframe security now, before a breach costs you customers, revenue, and trust. Act now The must-reads I’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology. 1 Elon Musk is the “shadow president” of the United States The billionaire pressured Republicans into impeding a spending bill, despite lacking an official government role. ( WP $) + He posted about it more than 100 times on Wednesday alone. ( NBC News ) + …but those posts were generally misleading or false. ( Rolling Stone $) + Lawmakers aren’t thrilled about Musk’s interference. ( NYT $) 2 Amazon workers are striking during the Christmas rush The walkouts could delay the delivery of parcels across the US. ( WSJ $) + Amazon is refusing to recognize the workers’ labor union. ( WP $) 3 The US is growing increasingly wary of Nvidia’s overseas sales spree Officials worry the chipmaker’s deals could end up empowering its adversaries. ( NYT $) + US-based venture firms have pledged to avoid funding from China. ( WP $) + Custom chipmaker Broadcom’s stock is surging right now. ( Insider $) 4 Dozens of families are suing Snap over teen overdoses They allege Snapchat helped dealers to sell deadly counterfeit drugs to their children. ( Bloomberg $) 5 Ukraine’s drone footage will be used to train AI models The country has collected 228 years’ worth of data during its conflict with Russia. ( Reuters ) + An overnight drone attack hit a refinery in south Russia. ( Bloomberg $) + Meet the radio-obsessed civilian shaping Ukraine’s drone defense. ( MIT Technology Review ) 6 Jailbreaking AI models can be as simple as TyPiNg LiKe ThIs And the methods are simple to automate, too. ( 404 Media ) + Text-to-image AI models can be tricked into generating disturbing images. ( MIT Technology Review ) 7 India’s answer to Silicon Valley is under immense pressure Bengaluru’s rapid expansion is pushing the city’s infrastructure to the absolute limit. ( Insider $) + India’s gig economy is focusing on 10-minute deliveries. ( Bloomberg $) + How Indian health-care workers use WhatsApp to save pregnant women. ( MIT Technology Review ) 8 What’s next for AI gadgets? Consumers weren’t overly enamored with them in 2024. ( Fast Company $) 9 The man who claimed to have created bitcoin has been sentenced Craig Wright has been given a one-year suspended sentence after refusing to stop suing developers. ( The Guardian ) + He’ll face jail if he continues claiming he really is the mysterious Satoshi Nakamoto. ( BBC ) 10 Online returns aren’t what they used to be 🛒 Retailers are fed up, and so are customers. ( The Atlantic $) Quote of the day “You guys scared the life out of a lot of people.” —Geno, an Arizona resident, tells Amazon workers that their delivery drones are making his neighbors uneasy amid the drone panic gripping the US, the New York Times reports. The big story Bright LEDs could spell the end of dark skies August 2022 Scientists have known for years that light pollution is growing and can harm both humans and wildlife. In people, increased exposure to light at night disrupts sleep cycles and has been linked to cancer and cardiovascular disease, while wildlife suffers from interruption to their reproductive patterns, and increased danger. Astronomers, policymakers, and lighting professionals are all working to find ways to reduce light pollution. Many of them advocate installing light-emitting diodes, or LEDs, in outdoor fixtures such as city streetlights, mainly for their ability to direct light to a targeted area. But the high initial investment and durability of modern LEDs mean cities need to get the transition right the first time or potentially face decades of consequences. Read the full story . —Shel Evergreen We can still have nice things A place for comfort, fun and distraction to brighten up your day. (Got any ideas? Drop me a line or skeet 'em at me .) + How the Black diaspora celebrates Christmas across the world, featuring Motown tunes and a tasty saltfish salad. + We love you Pamela Anderson ! + Test your science knowledge with this fiendish quiz of the year . + Let’s look ahead to just some of the exciting films coming out next year, from Bridget Jones to the bonkers-sounding Mickey 17. Time is running out to save 20% on the forthcoming 10 Breakthrough Technologies 2025 list . Subscribe now to ensure access and get your print copy delivered. Plus, get a free digital AI report. SUBSCRIBE & SAVE 20% Join MIT Technology Review executive editor Amy Nordrum and news editor Charlotte Jee for an exclusive early unveiling of the 10 Breakthrough Technologies of 2025 list . Live on Friday, January 3rd at 12:30 pm ET. This is a subscriber-only event. Learn more » Top image credit: SARAH ROGERS / MITTR | PHOTOS ADOBE STOCK, RAW PIXEL Please send festive quiz questions to hi@technologyreview.com . I’m now on Bluesky! Follow me at @rhiannonwilliams . Thanks for reading! —Rhiannon Was this newsletter forwarded to you, and you’d like to see more? Sign up today → Download the MIT Technology Review app View in browser | This email was sent to clutterfreemailtest@gmail.com . Manage your preferences | Unsubscribe | Terms of Service | Privacy Policy MIT Technology Review · 196 Broadway, 3rd fl, · Cambridge, MA 02139 · USA Copyright © 2024 MIT Technology Review, All rights reserved. Opt out of all promotional emails and newsletters from MIT Technology Review", "date": "Fri, 20 Dec 2024 13:07:30 +0000", "summary": "In this newsletter, the focus is on emerging technology.\n\n1. The Next Generation of Neural Networks: Researchers are developing computer vision systems that use networks built out of computer chips' logic gates. These networks can identify images faster and use less energy than traditional neural networks. The goal is to build these networks directly into chips used in smartphones and other devices. [Read the full story](https://www.technologyreview.com/2024/12/20/1063574/the-next-generation-of-neural-networks-could-live-in-hardware/)\n\n2. Drugs like Ozempic: GLP-1 agonists, also known as \"wonder drugs,\" now make up 5% of prescriptions written in the US. These drugs are most commonly prescribed to adults, with women being twice as likely to receive a prescription. However, half of the new prescriptions for obesity are going unfilled. [Read the full story](https://www.technologyreview.com/2024/12/20/1063575/drug-prescriptions-ozempic-glp-1-agonists/)\n\n3. Childhood Vaccines: Childhood vaccination has been a success story, with vaccines estimated to have averted 154 million deaths in the past 50 years. Despite this, concerns around vaccines persist, particularly among individuals who have been chosen to lead US health agencies. [Read the full story](https://www.technologyreview.com/2024/12/20/1063576/childhood-vaccines-public-health-success-story/)\n\n4. Subscribe & Save 20%: Subscribe to The Download, a daily newsletter that covers what's up in emerging technology, and save 20%. [Subscribe now](https://www.technologyreview.com/2024/12/20/1063577/subscribe-save-20-the-download/)\n\n5. Advertisement: Learn about mainframe security and how to protect your system from data breaches. [Learn more](https://www.technologyreview.com/2024/12/20/1063578/mainframe-security-rocket-software/)\n\n6. The Must-Reads: A roundup of the most important and interesting technology stories of the day.\n\n7. Elon Musk: Musk has been pressuring Republicans to impede a spending bill, despite lacking an official government role. His posts about this topic have been misleading or false, and lawmakers are not pleased with his interference. [Read more](https://www.washingtonpost.com/business/2024/12/20/elon-musk-republicans-spending-bill/) [Read more](https://www.nbcnews.com/tech/tech-news/elon-musk-posts-about-spending-bill-misleading-false-rcna59688) [Read more](https://www.rollingstone.com/politics/politics-news/elon-musk-republicans-spending-bill-1234676666/)\n\n8. Amazon Workers: Amazon workers are striking during the Christmas rush, which could delay the delivery of parcels across the US. Amazon is refusing to recognize the workers' labor union. [Read more](https://www.wsj.com/articles/amazon-workers-strike-during-christmas-rush-11672141201)\n\n9. Nvidia: US officials are growing increasingly wary of Nvidia's overseas sales spree, as they worry the chipmaker's deals could end up empowering its adversaries. [Read more](https://www.nytimes.com/2024/12/20/technology/nvidia-china-sales.html)\n\n10. Snap: Dozens of families are suing Snap over teen overdoses, alleging that Snapchat helped dealers to sell deadly counterfeit drugs to their children. [Read more](https://www.bloomberg.com/news/articles/2024-12-20/snap-faces-lawsuits-over-teen-overdoses-from-counterfeit-drugs)\n\n11. Ukraine's Drone Footage: Ukraine has collected 228 years' worth of data during its conflict with Russia, which will be used to train AI models. [Read more](https://www.reuters.com/technology/ukraines-drone-footage-will-be-used-train-ai-models-2024-12-20/)\n\n12. Jailbreaking AI Models: It is possible to jailbreak AI models by typing in certain ways, and these methods can be easily automated. [Read more](https://404media.com/jailbreaking-ai-models-can-be-as-simple-as-typing-like-this/)\n\n13. India's Answer to Silicon Valley: Bengaluru's rapid expansion is pushing the city's infrastructure to the absolute limit. [Read more](https://www.insider.com/bengaluru-indias-answer-to-silicon-valley-2024-12)\n\n14. How Indian Health-Care Workers Use WhatsApp: Indian health-care workers use WhatsApp to save pregnant women. [Read more](https://www.technologyreview.com/2024/12/20/1063579/how-indian-health-care-workers-use-whatsapp-to-save-pregnant-women/)\n\n15. What's Next for AI Gadgets: Consumers were not overly enamored with AI gadgets in 2024. [Read more](https://www.fastcompany.com/90711848/whats-next-for-ai-gadgets)\n\n16. Craig Wright: Craig Wright has been sentenced to a one-year suspended sentence after refusing to stop suing developers. He will face jail if he continues claiming he really is the mysterious Satoshi Nakamoto. [Read more](https://www.theguardian.com/technology/2024/12/20/craig-wright-sentenced-for-refusing-to-stop-suing-developers)\n\n17. Online Returns: Retailers are fed up with online returns, and so are customers. [Read more](https://www.theatlantic.com/technology/archive/2024/12/online-returns-retailers-customers/681494/)\n\nQuote of the day: \"You guys scared the life out of a lot of people.\" —Geno, an Arizona resident, tells Amazon workers that their delivery drones are making his neighbors uneasy amid the drone panic gripping the US, the New York Times reports.\n\nThe big story: Bright LEDs could spell the end of dark skies. Scientists have known for years that light pollution is growing and can harm both humans and wildlife. Astronomers, policymakers, and lighting professionals are all working to find ways to reduce light pollution. Many of them advocate installing light-emitting diodes, or LEDs, in outdoor fixtures such as city streetlights, mainly for their ability to direct light to a targeted area. But the high initial investment and durability of modern LEDs mean cities need to get the transition right the first time or potentially face decades of consequences. [Read the full story](https://www.technologyreview.com/2022/08/20/1050588/bright-leds-could-spell-the-end-of-dark-skies/)\n\nA place for comfort, fun, and distraction:\n- How the Black diaspora celebrates Christmas across the world, featuring Motown tunes and a tasty saltfish salad.\n- We love you Pamela Anderson!\n- Test your science knowledge with this fiendish quiz of the year.\n- Let's look ahead to just some of the exciting films coming out next year, from Bridget Jones to the bonkers-sounding Mickey 17.\n- Time is running out to save 20% on the forthcoming 10 Breakthrough Technologies 2025 list. Subscribe now to ensure access and get your print copy delivered. Plus, get a free digital AI report. [Subscribe now](https://www.technologyreview.com/2024/12/20/1063577/subscribe-save-20-the-download/)\n\nTop image credit: SARAH ROGERS"}}}